[Killed] Negate expression
Payment/Payment/Users/UserMemoryRepository.cs:14:20
 
         public static User FindUser(string id)
         {
-            return _users.TryGetValue(id, out User user) ? user : null;
+            return !(_users.TryGetValue(id, out User user) ) ? user : null;
         }
 
killedBy: Payment.OutOfTask.Test.UserMemoryRepositoryTest.AddFriend_InvalidUser02; Payment.OutOfTask.Test.UserMemoryRepositoryTest.GetCommonFriend_InvalidUser02; Payment.OutOfTask.Test.UserMemoryRepositoryTest.FindUser_Valid

[Killed] Block removal mutation
Payment/Payment/Users/UserMemoryRepository.cs:18:9
         }
 
         public static void Save(User user)
-        {
-            _users[user.Id] = user;
-        }
+        {}
 
         public static void Delete(string id)
killedBy: Payment.OutOfTask.Test.UserMemoryRepositoryTest.AddFriend_InvalidUser02; Payment.OutOfTask.Test.UserMemoryRepositoryTest.GetCommonFriend_InvalidUser02; Payment.OutOfTask.Test.UserMemoryRepositoryTest.FindUser_Valid

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:26:38
         {
             var user2Delete = FindUser(id);
 
-            if (user2Delete == null) return;
+            if (user2Delete == null) ;
 
             foreach (var user2 in user2Delete.Friends)
killedBy: Payment.OutOfTask.Test.UserServiceTest.DeleteUser_NotCreated

[Killed] Equality mutation
Payment/Payment/Users/UserMemoryRepository.cs:26:17
         {
             var user2Delete = FindUser(id);
 
-            if (user2Delete == null) return;
+            if (user2Delete != null) return;
 
             foreach (var user2 in user2Delete.Friends)
killedBy: Payment.OutOfTask.Test.UserServiceTest.DeleteUser_NotCreated

[Killed] Null coalescing mutation (remove left)
Payment/Payment/Users/UserMemoryRepository.cs:38:25
 
         public static void AddFriend(string idUser1, string idUser2)
         {
-            var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser1}");
+            var user1 = FindUser(idUser1);
             var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
 
killedBy: Payment.OutOfTask.Test.UserMemoryRepositoryTest.AddFriend_InvalidUser01

[Killed] String mutation
Payment/Payment/Users/UserMemoryRepository.cs:38:82
 
         public static void AddFriend(string idUser1, string idUser2)
         {
-            var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser1}");
+            var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"");
             var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
 
killedBy: Payment.OutOfTask.Test.UserMemoryRepositoryTest.AddFriend_InvalidUser01

[Killed] Null coalescing mutation (remove left)
Payment/Payment/Users/UserMemoryRepository.cs:39:25
         public static void AddFriend(string idUser1, string idUser2)
         {
             var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser1}");
-            var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
+            var user2 = FindUser(idUser2);
 
             if (!user1.Friends.Contains(user2))
killedBy: Payment.OutOfTask.Test.UserMemoryRepositoryTest.AddFriend_InvalidUser02

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Payment/Payment/Users/UserMemoryRepository.cs:41:17
             var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser1}");
             var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
 
-            if (!user1.Friends.Contains(user2))
+            if (user1.Friends.Contains(user2))
                 user1.Friends.Add(user2);
 

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:42:17
             var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
 
             if (!user1.Friends.Contains(user2))
-                user1.Friends.Add(user2);
+                ;
 
             if (!user2.Friends.Contains(user1))

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Payment/Payment/Users/UserMemoryRepository.cs:44:17
             if (!user1.Friends.Contains(user2))
                 user1.Friends.Add(user2);
 
-            if (!user2.Friends.Contains(user1))
+            if (user2.Friends.Contains(user1))
                 user2.Friends.Add(user1);
         }

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:45:17
                 user1.Friends.Add(user2);
 
             if (!user2.Friends.Contains(user1))
-                user2.Friends.Add(user1);
+                ;
         }
 

[Killed] String mutation
Payment/Payment/Users/UserMemoryRepository.cs:51:82
         public static IReadOnlyList<IUser> GetCommonFriends(string idUser1, string idUser2)
         {
             var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser1}");
-            var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
+            var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"");
 
             return user1.Friends.Intersect(user2.Friends).ToList();
killedBy: Payment.OutOfTask.Test.UserMemoryRepositoryTest.GetCommonFriend_InvalidUser02

[Killed] Linq method mutation (Intersect() to Union())
Payment/Payment/Users/UserMemoryRepository.cs:53:20
             var user1 = FindUser(idUser1) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser1}");
             var user2 = FindUser(idUser2) ?? throw new InvalidOperationException($"System is not able to find any user with id={idUser2}");
 
-            return user1.Friends.Intersect(user2.Friends).ToList();
+            return user1.Friends.Union(user2.Friends).ToList();
         }
 
