[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:24:31
 
         public void DeleteUser(IUser user)
         {
-            if (user == null) throw new ArgumentException("User must be valid.");
+            if (user == null) ;
 
             UserMemoryRepository.Delete(user.Id);
killedBy: Payment.OutOfTask.Test.UserServiceTest.DeleteUser_Null

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:24:17
 
         public void DeleteUser(IUser user)
         {
-            if (user == null) throw new ArgumentException("User must be valid.");
+            if (user != null) throw new ArgumentException("User must be valid.");
 
             UserMemoryRepository.Delete(user.Id);

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:26:13
         {
             if (user == null) throw new ArgumentException("User must be valid.");
 
-            UserMemoryRepository.Delete(user.Id);
+            ;
         }
 

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:31:32
 
         public void AddFriendship(IUser user1, IUser user2)
         {
-            if (user1 == null) throw new ArgumentException("Both users must be valid.");
+            if (user1 == null) ;
             if (user2 == null) throw new ArgumentException("Both users must be valid.");
 
killedBy: Payment.OutOfTask.Test.UserServiceTest.AddFriendship_User01Null

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:31:17
 
         public void AddFriendship(IUser user1, IUser user2)
         {
-            if (user1 == null) throw new ArgumentException("Both users must be valid.");
+            if (user1 != null) throw new ArgumentException("Both users must be valid.");
             if (user2 == null) throw new ArgumentException("Both users must be valid.");
 
killedBy: Payment.OutOfTask.Test.UserServiceTest.AddFriendship_User01Null

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:32:17
         public void AddFriendship(IUser user1, IUser user2)
         {
             if (user1 == null) throw new ArgumentException("Both users must be valid.");
-            if (user2 == null) throw new ArgumentException("Both users must be valid.");
+            if (user2 != null) throw new ArgumentException("Both users must be valid.");
 
             UserMemoryRepository.AddFriend(user1.Id, user2.Id);
killedBy: Payment.OutOfTask.Test.UserServiceTest.AddFriendship_User02Null

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:32:32
         public void AddFriendship(IUser user1, IUser user2)
         {
             if (user1 == null) throw new ArgumentException("Both users must be valid.");
-            if (user2 == null) throw new ArgumentException("Both users must be valid.");
+            if (user2 == null) ;
 
             UserMemoryRepository.AddFriend(user1.Id, user2.Id);
killedBy: Payment.OutOfTask.Test.UserServiceTest.AddFriendship_User02Null

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:34:13
             if (user1 == null) throw new ArgumentException("Both users must be valid.");
             if (user2 == null) throw new ArgumentException("Both users must be valid.");
 
-            UserMemoryRepository.AddFriend(user1.Id, user2.Id);
+            ;
         }
         public IReadOnlyList<IUser> GetCommonFriends(IUser user1, IUser user2)

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:47:17
             if (user1 == null) throw new ArgumentException("Both users must be valid.");
             if (user2 == null) throw new ArgumentException("Both users must be valid.");
             
-            if (user1 == user2) return new List<IUser> { user1 };
+            if (user1 != user2) return new List<IUser> { user1 };
 
             Dictionary<IUser, int> distances = new();

[Killed] Negate expression
Payment/Payment/Users/UserService.cs:56:20
             distances[user1] = 0;
             queue.Enqueue(user1);
 
-            while (queue.Count > 0)
+            while (!(queue.Count > 0))
             {
                 var currentUser = queue.Dequeue();
