[Killed] Null coalescing mutation (remove left)
Payment/Payment/Wallets/Share.cs:13:21
         {
             Id = Guid.NewGuid().ToString("N");
             WalletId = walletId;
-            Owner = owner ?? throw new ArgumentException("Owner must be valid.");
+            Owner = owner;
             Amount = amount;
         }
killedBy: Payment.OutOfTask.Test.ShareTest.Initialization_InvalidOwner

[Killed] String mutation
Payment/Payment/Wallets/Share.cs:13:58
         {
             Id = Guid.NewGuid().ToString("N");
             WalletId = walletId;
-            Owner = owner ?? throw new ArgumentException("Owner must be valid.");
+            Owner = owner ?? throw new ArgumentException("");
             Amount = amount;
         }
killedBy: Payment.OutOfTask.Test.ShareTest.Initialization_InvalidOwner

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Payment/Payment/Wallets/Share.cs:22:13
         public Money Amount { get; private set; }
         public void AddAmount(Money shareAmount)
         {
-            Amount += shareAmount;
+            Amount -= shareAmount;
         }
     }
killedBy: Payment.OutOfTask.Test.ShareTest.AddAmounts
