[Killed] Null coalescing mutation (remove left)
Payment/Payment/Wallets/Wallet.cs:13:21
         public Wallet(IUser owner, Currency currency)
         {
             Id = Guid.NewGuid().ToString("N");
-            Owner = owner ?? throw new ArgumentException("Owner must be valid.");
+            Owner = owner;
             Amount = new Money(0, currency);
             Currency = currency;
killedBy: Payment.OutOfTask.Test.WalletTest.Initialization_InvalidOwner

[Killed] String mutation
Payment/Payment/Wallets/Wallet.cs:13:58
         public Wallet(IUser owner, Currency currency)
         {
             Id = Guid.NewGuid().ToString("N");
-            Owner = owner ?? throw new ArgumentException("Owner must be valid.");
+            Owner = owner ?? throw new ArgumentException("");
             Amount = new Money(0, currency);
             Currency = currency;
killedBy: Payment.OutOfTask.Test.WalletTest.Initialization_InvalidOwner

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Payment/Payment/Wallets/Wallet.cs:26:13
 
         public void AddAmount(Money amount)
         {
-            Amount += amount;
+            Amount -= amount;
         }
     }
