[Killed] Equality mutation
src/Payment/Payment.Core/Money.cs:27:17
 
         public static Money operator +(Money a, Money b)
         {
-            if (a.Currency == b.Currency)
+            if (a.Currency != b.Currency)
                 return new Money(a.Value + b.Value, b.Currency);
 
killedBy: Payment.Core.Test.MoneyTests.MoneyAdditionTest

[Killed] Arithmetic mutation
src/Payment/Payment.Core/Money.cs:28:34
         public static Money operator +(Money a, Money b)
         {
             if (a.Currency == b.Currency)
-                return new Money(a.Value + b.Value, b.Currency);
+                return new Money(a.Value - b.Value, b.Currency);
 
             throw new ArgumentException($"Cannot perform operation with different {nameof(Currency)}");
killedBy: Payment.Core.Test.MoneyTests.MoneyAdditionTest

[Killed] Statement mutation
src/Payment/Payment.Core/Money.cs:30:13
             if (a.Currency == b.Currency)
                 return new Money(a.Value + b.Value, b.Currency);
 
-            throw new ArgumentException($"Cannot perform operation with different {nameof(Currency)}");
+            ;
         }
         public static bool operator ==(Money a, Money b) => a.Equals(b);
killedBy: Payment.Core.Test.MoneyTests.MoneyAdditionTest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Payment/Payment.Core/Money.cs:33:61
             throw new ArgumentException($"Cannot perform operation with different {nameof(Currency)}");
         }
         public static bool operator ==(Money a, Money b) => a.Equals(b);
-        public static bool operator !=(Money a, Money b) => !(a.Equals(b));
+        public static bool operator !=(Money a, Money b) => (a.Equals(b));
         public static Money operator -(Money a, Money b)
         {
killedBy: Payment.Core.Test.MoneyTests.MoneyEqualityTest

[Killed] Arithmetic mutation
src/Payment/Payment.Core/Money.cs:37:34
         public static Money operator -(Money a, Money b)
         {
             if (a.Currency == b.Currency)
-                return new Money(a.Value - b.Value, b.Currency);
+                return new Money(a.Value + b.Value, b.Currency);
 
             throw new ArgumentException($"Cannot perform operation with different {nameof(Currency)}");
killedBy: Payment.Core.Test.MoneyTests.MoneySubtractionTest
