[Killed] Block removal mutation
tech-test/Payment/Payment.Core/Money.cs:17:9
         }
 
         public static Money Euro(long amount)
-        {
-            return new Money(amount, Currency.EUR);
-        }
+        {}
         public static Money Usd(long amount)
         {

[NoCoverage] Block removal mutation
tech-test/Payment/Payment.Core/Money.cs:21:9
             return new Money(amount, Currency.EUR);
         }
         public static Money Usd(long amount)
-        {
-            return new Money(amount, Currency.USD);
-        }
+        {}
 
         public static Money operator +(Money a, Money b) => new Money(a.Value + b.Value, b.Currency);

[Killed] Arithmetic mutation
tech-test/Payment/Payment.Core/Money.cs:25:71
             return new Money(amount, Currency.USD);
         }
 
-        public static Money operator +(Money a, Money b) => new Money(a.Value + b.Value, b.Currency);
+        public static Money operator +(Money a, Money b) => new Money(a.Value - b.Value, b.Currency);
         public static bool operator ==(Money a, Money b) => a.Equals(b);
         public static bool operator !=(Money a, Money b) => !(a == b);

[NoCoverage] Equality mutation
tech-test/Payment/Payment.Core/Money.cs:27:63
 
         public static Money operator +(Money a, Money b) => new Money(a.Value + b.Value, b.Currency);
         public static bool operator ==(Money a, Money b) => a.Equals(b);
-        public static bool operator !=(Money a, Money b) => !(a == b);
+        public static bool operator !=(Money a, Money b) => !(a != b);
         public static Money operator -(Money a) => new Money(-a.Value, a.Currency);
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
tech-test/Payment/Payment.Core/Money.cs:27:61
 
         public static Money operator +(Money a, Money b) => new Money(a.Value + b.Value, b.Currency);
         public static bool operator ==(Money a, Money b) => a.Equals(b);
-        public static bool operator !=(Money a, Money b) => !(a == b);
+        public static bool operator !=(Money a, Money b) => (a == b);
         public static Money operator -(Money a) => new Money(-a.Value, a.Currency);
 

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
tech-test/Payment/Payment.Core/Money.cs:28:62
         public static Money operator +(Money a, Money b) => new Money(a.Value + b.Value, b.Currency);
         public static bool operator ==(Money a, Money b) => a.Equals(b);
         public static bool operator !=(Money a, Money b) => !(a == b);
-        public static Money operator -(Money a) => new Money(-a.Value, a.Currency);
+        public static Money operator -(Money a) => new Money(+a.Value, a.Currency);
 
         public bool Equals(Money other)

[Killed] Equality mutation
tech-test/Payment/Payment.Core/Money.cs:32:44
 
         public bool Equals(Money other)
         {
-            return Value == other.Value && Currency == other.Currency;
+            return Value == other.Value && Currency != other.Currency;
         }
 

[Killed] Equality mutation
tech-test/Payment/Payment.Core/Money.cs:32:20
 
         public bool Equals(Money other)
         {
-            return Value == other.Value && Currency == other.Currency;
+            return Value != other.Value && Currency == other.Currency;
         }
 

[NoCoverage] Block removal mutation
tech-test/Payment/Payment.Core/Money.cs:36:9
         }
 
         public override bool Equals(object obj)
-        {
-            return obj is Money other && Equals(other);
-        }
+        {}
 
         public override int GetHashCode()

[NoCoverage] Bitwise mutation
tech-test/Payment/Payment.Core/Money.cs:44:24
         {
             unchecked
             {
-                return (Value.GetHashCode() * 397) ^ (int)Currency;
+                return ~((Value.GetHashCode() * 397) ^ (int)Currency);
             }
         }

[NoCoverage] Arithmetic mutation
tech-test/Payment/Payment.Core/Money.cs:44:25
         {
             unchecked
             {
-                return (Value.GetHashCode() * 397) ^ (int)Currency;
+                return (Value.GetHashCode() / 397) ^ (int)Currency;
             }
         }
