[Killed] Negate expression
Payment/Payment/Users/UserMemoryRepository.cs:14:17
         public static User FindUser(string id)
         {
 
-            if (_users.TryGetValue(id, out User user))
+            if (!(_users.TryGetValue(id, out User user)))
                 return user;
 

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:22:13
 
         public static void Save(User user)
         {
-            _users.Add(user.Id, user);
+            ;
         }
 

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:31:17
 
             foreach (var user2 in user2Delete.Friends)
             {
-                FindUser(user2.Id).Friends.Remove(user2Delete);
+                ;
             }
 

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:34:13
                 FindUser(user2.Id).Friends.Remove(user2Delete);
             }
 
-            _users.Remove(id);
+            ;
         }
 

[Killed] Equality mutation
Payment/Payment/Users/UserMemoryRepository.cs:42:41
             var user1 = FindUser(idUser1);
             var f2 = FindUser(idUser2);
 
-            if (!user1.Friends.Any(x => x.Id == f2.Id))
+            if (!user1.Friends.Any(x => x.Id != f2.Id))
                 user1.Friends.Add(f2);
 

[Killed] Linq method mutation (Any() to All())
Payment/Payment/Users/UserMemoryRepository.cs:42:18
             var user1 = FindUser(idUser1);
             var f2 = FindUser(idUser2);
 
-            if (!user1.Friends.Any(x => x.Id == f2.Id))
+            if (!user1.Friends.All(x => x.Id == f2.Id))
                 user1.Friends.Add(f2);
 

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:43:17
             var f2 = FindUser(idUser2);
 
             if (!user1.Friends.Any(x => x.Id == f2.Id))
-                user1.Friends.Add(f2);
+                ;
 
             if (!f2.Friends.Any(x => x.Id == user1.Id))

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Payment/Payment/Users/UserMemoryRepository.cs:45:17
             if (!user1.Friends.Any(x => x.Id == f2.Id))
                 user1.Friends.Add(f2);
 
-            if (!f2.Friends.Any(x => x.Id == user1.Id))
+            if (f2.Friends.Any(x => x.Id == user1.Id))
                 f2.Friends.Add(user1);
         }

[Killed] Linq method mutation (Any() to All())
Payment/Payment/Users/UserMemoryRepository.cs:45:18
             if (!user1.Friends.Any(x => x.Id == f2.Id))
                 user1.Friends.Add(f2);
 
-            if (!f2.Friends.Any(x => x.Id == user1.Id))
+            if (!f2.Friends.All(x => x.Id == user1.Id))
                 f2.Friends.Add(user1);
         }

[Killed] Statement mutation
Payment/Payment/Users/UserMemoryRepository.cs:46:17
                 user1.Friends.Add(f2);
 
             if (!f2.Friends.Any(x => x.Id == user1.Id))
-                f2.Friends.Add(user1);
+                ;
         }
 

[Killed] Linq method mutation (Intersect() to Union())
Payment/Payment/Users/UserMemoryRepository.cs:54:20
             var user1Friends = FindUser(idUser1).Friends;
             var user2Friends = FindUser(idUser2).Friends;
 
-            return user1Friends.Intersect(user2Friends).ToList();
+            return user1Friends.Union(user2Friends).ToList();
         }
 
