[Killed] Block removal mutation
Payment/Payment/Users/UserService.cs:11:9
     public class UserService : IUserService
     {
         public IUser GetUser(string id)
-        {
-            return UserMemoryRepository.FindUser(id);
-        }
+        {}
 
         public IUser CreateUser(string name)

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:18:13
         public IUser CreateUser(string name)
         {
             var user = new User(name);
-            UserMemoryRepository.Save(user);
+            ;
             return user;
         }

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:24:13
 
         public void DeleteUser(IUser user)
         {
-            UserMemoryRepository.Delete(user.Id);
+            ;
         }
 

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:29:13
 
         public void AddFriendship(IUser user1, IUser user2)
         {
-            UserMemoryRepository.AddFriend(user1.Id, user2.Id);
+            ;
         }
         public IReadOnlyList<IUser> GetCommonFriends(IUser user1, IUser user2)

[Killed] Block removal mutation
Payment/Payment/Users/UserService.cs:32:9
             UserMemoryRepository.AddFriend(user1.Id, user2.Id);
         }
         public IReadOnlyList<IUser> GetCommonFriends(IUser user1, IUser user2)
-        {
-            return UserMemoryRepository.GetCommonFriends(user1.Id, user2.Id);
-        }
+        {}
         public IReadOnlyList<IUser> GetConnectionList(IUser user1, IUser user2, uint maxLevel)
         {

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:37:17
         }
         public IReadOnlyList<IUser> GetConnectionList(IUser user1, IUser user2, uint maxLevel)
         {
-            if (user1 == null || user2 == null) throw new ArgumentException("Both users must be valid.");
+            if (user1 != null || user2 == null) throw new ArgumentException("Both users must be valid.");
             if (user1 == user2) return new List<IUser> { user1 };
 

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:37:34
         }
         public IReadOnlyList<IUser> GetConnectionList(IUser user1, IUser user2, uint maxLevel)
         {
-            if (user1 == null || user2 == null) throw new ArgumentException("Both users must be valid.");
+            if (user1 == null || user2 != null) throw new ArgumentException("Both users must be valid.");
             if (user1 == user2) return new List<IUser> { user1 };
 

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:38:17
         public IReadOnlyList<IUser> GetConnectionList(IUser user1, IUser user2, uint maxLevel)
         {
             if (user1 == null || user2 == null) throw new ArgumentException("Both users must be valid.");
-            if (user1 == user2) return new List<IUser> { user1 };
+            if (user1 != user2) return new List<IUser> { user1 };
 
             Dictionary<IUser, int> distances = new();

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:45:13
             Queue<IUser> queue = new();
 
             distances[user1] = 0;
-            queue.Enqueue(user1);
+            ;
 
             while (queue.Count > 0)

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:47:20
             distances[user1] = 0;
             queue.Enqueue(user1);
 
-            while (queue.Count > 0)
+            while (queue.Count < 0)
             {
                 var currentUser = queue.Dequeue();

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:47:20
             distances[user1] = 0;
             queue.Enqueue(user1);
 
-            while (queue.Count > 0)
+            while (queue.Count >= 0)
             {
                 var currentUser = queue.Dequeue();

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:51:21
             {
                 var currentUser = queue.Dequeue();
 
-                if (currentUser == user2) break; // We found the destination user
+                if (currentUser != user2) break; // We found the destination user
 
                 foreach (var friend in currentUser.Friends)

[Survived] Statement mutation
Payment/Payment/Users/UserService.cs:51:43
             {
                 var currentUser = queue.Dequeue();
 
-                if (currentUser == user2) break; // We found the destination user
+                if (currentUser == user2) ; // We found the destination user
 
                 foreach (var friend in currentUser.Friends)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Payment/Payment/Users/UserService.cs:55:25
 
                 foreach (var friend in currentUser.Friends)
                 {
-                    if (!distances.ContainsKey(friend))
+                    if (distances.ContainsKey(friend))
                     {
                         distances[friend] = distances[currentUser] + 1;

[Survived] Arithmetic mutation
Payment/Payment/Users/UserService.cs:57:45
                 {
                     if (!distances.ContainsKey(friend))
                     {
-                        distances[friend] = distances[currentUser] + 1;
+                        distances[friend] = distances[currentUser] - 1;
                         predecessors[friend] = currentUser;
                         queue.Enqueue(friend);

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:59:25
                     {
                         distances[friend] = distances[currentUser] + 1;
                         predecessors[friend] = currentUser;
-                        queue.Enqueue(friend);
+                        ;
                     }
                 }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Payment/Payment/Users/UserService.cs:64:17
                 }
             }
 
-            if (!distances.ContainsKey(user2)) return new List<IUser>(); // No path found
+            if (distances.ContainsKey(user2)) return new List<IUser>(); // No path found
 
             var path = new List<IUser>();

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:69:20
             var path = new List<IUser>();
             var current = user2;
 
-            while (current != user1)
+            while (current == user1)
             {
                 path.Insert(0, current);

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:71:17
 
             while (current != user1)
             {
-                path.Insert(0, current);
+                ;
                 current = predecessors[current];
             }

[Killed] Statement mutation
Payment/Payment/Users/UserService.cs:75:13
                 current = predecessors[current];
             }
 
-            path.Insert(0, user1);
+            ;
 
             if (path.Count - 1 > maxLevel)

[Killed] Negate expression
Payment/Payment/Users/UserService.cs:77:17
 
             path.Insert(0, user1);
 
-            if (path.Count - 1 > maxLevel)
+            if (!(path.Count - 1 > maxLevel))
                 return new List<IUser>(); // Path exceeds the specified maxLevel
 

[Killed] Equality mutation
Payment/Payment/Users/UserService.cs:77:17
 
             path.Insert(0, user1);
 
-            if (path.Count - 1 > maxLevel)
+            if (path.Count - 1 < maxLevel)
                 return new List<IUser>(); // Path exceeds the specified maxLevel
 
