[Killed] Block removal mutation
Payment/Payment/Wallets/Share.cs:21:9
         public IUser Owner { get; }
         public Money Amount { get; private set; }
         public void AddAmount(Money shareAmount)
-        {
-            Amount += shareAmount;
-        }
+        {}
     }
 }
