[Survived] String mutation
Payment/Payment/Wallets/Wallet.cs:12:42
     {
         public Wallet(IUser owner, Currency currency)
         {
-            Id = Guid.NewGuid().ToString("N");
+            Id = Guid.NewGuid().ToString("");
             Owner = owner;
             Amount = new Money(0, currency);

[Killed] Block removal mutation
Payment/Payment/Wallets/Wallet.cs:25:9
         public Currency Currency { get; }
 
         public void AddAmount(Money amount)
-        {
-            Amount += amount;
-        }
+        {}
     }
 }
