[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Payment/Payment/Wallets/WalletMemoryRepository.cs:11:17
 
         public static Wallet FindWallet(string id)
         {
-            if (!_wallets.TryGetValue(id, out var wallet))
+            if (_wallets.TryGetValue(id, out var wallet))
                 return null;
 

[Killed] Statement mutation
Payment/Payment/Wallets/WalletMemoryRepository.cs:19:13
 
         public static void Save(Wallet wallet)
         {
-            _wallets.Add(wallet.Id, wallet);
+            ;
         }
     }
