[Killed] Statement mutation
Payment/Payment/Wallets/WalletService.cs:14:13
         public IWallet CreateWallet(IUser owner, Currency currency)
         {
             var wallet = new Wallet(owner, currency);
-            WalletMemoryRepository.Save(wallet);
+            ;
             return wallet;
         }

[Killed] Block removal mutation
Payment/Payment/Wallets/WalletService.cs:19:9
         }
 
         public IWallet GetWallet(string id)
-        {
-            return WalletMemoryRepository.FindWallet(id);
-        }
+        {}
 
         public void Contribute(IWallet wallet, IUser author, Money amount)

[Killed] Statement mutation
Payment/Payment/Wallets/WalletService.cs:25:53
 
         public void Contribute(IWallet wallet, IUser author, Money amount)
         {
-            if (wallet.Currency != amount.Currency) throw new ArgumentException("User should not be able to contribute in a different currency than the wallet one");
+            if (wallet.Currency != amount.Currency) ;
 
             if (amount.Value <= 0) throw new ArgumentException("User should not be able to contribute with a negative value");

[Killed] Equality mutation
Payment/Payment/Wallets/WalletService.cs:25:17
 
         public void Contribute(IWallet wallet, IUser author, Money amount)
         {
-            if (wallet.Currency != amount.Currency) throw new ArgumentException("User should not be able to contribute in a different currency than the wallet one");
+            if (wallet.Currency == amount.Currency) throw new ArgumentException("User should not be able to contribute in a different currency than the wallet one");
 
             if (amount.Value <= 0) throw new ArgumentException("User should not be able to contribute with a negative value");

[Killed] Equality mutation
Payment/Payment/Wallets/WalletService.cs:27:17
         {
             if (wallet.Currency != amount.Currency) throw new ArgumentException("User should not be able to contribute in a different currency than the wallet one");
 
-            if (amount.Value <= 0) throw new ArgumentException("User should not be able to contribute with a negative value");
+            if (amount.Value > 0) throw new ArgumentException("User should not be able to contribute with a negative value");
 
             wallet.AddAmount(amount);

[Killed] Statement mutation
Payment/Payment/Wallets/WalletService.cs:27:36
         {
             if (wallet.Currency != amount.Currency) throw new ArgumentException("User should not be able to contribute in a different currency than the wallet one");
 
-            if (amount.Value <= 0) throw new ArgumentException("User should not be able to contribute with a negative value");
+            if (amount.Value <= 0) ;
 
             wallet.AddAmount(amount);

[Killed] Statement mutation
Payment/Payment/Wallets/WalletService.cs:29:13
 
             if (amount.Value <= 0) throw new ArgumentException("User should not be able to contribute with a negative value");
 
-            wallet.AddAmount(amount);
+            ;
 
             var contributorShare = wallet.Shares.SingleOrDefault(x => x.Owner.Id == author.Id);

[Killed] Linq method mutation (SingleOrDefault() to Single())
Payment/Payment/Wallets/WalletService.cs:31:36
 
             wallet.AddAmount(amount);
 
-            var contributorShare = wallet.Shares.SingleOrDefault(x => x.Owner.Id == author.Id);
+            var contributorShare = wallet.Shares.Single(x => x.Owner.Id == author.Id);
 
             if (contributorShare == null)

[Killed] Equality mutation
Payment/Payment/Wallets/WalletService.cs:31:71
 
             wallet.AddAmount(amount);
 
-            var contributorShare = wallet.Shares.SingleOrDefault(x => x.Owner.Id == author.Id);
+            var contributorShare = wallet.Shares.SingleOrDefault(x => x.Owner.Id != author.Id);
 
             if (contributorShare == null)

[Killed] Equality mutation
Payment/Payment/Wallets/WalletService.cs:33:17
 
             var contributorShare = wallet.Shares.SingleOrDefault(x => x.Owner.Id == author.Id);
 
-            if (contributorShare == null)
+            if (contributorShare != null)
             {
                 wallet.Shares.Add(new Share(author, wallet.Id, amount));

[Killed] Statement mutation
Payment/Payment/Wallets/WalletService.cs:35:17
 
             if (contributorShare == null)
             {
-                wallet.Shares.Add(new Share(author, wallet.Id, amount));
+                ;
             }
             else

[Killed] Statement mutation
Payment/Payment/Wallets/WalletService.cs:39:17
             }
             else
             {
-                contributorShare.AddAmount(amount);
+                ;
             }
         }
