[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MutationTestSample/src/Payment/Money.cs:33:61
             throw new ArgumentException($"Cannot perform operation with different {nameof(Currency)}");
         }
         public static bool operator ==(Money a, Money b) => a.Equals(b);
-        public static bool operator !=(Money a, Money b) => !a.Equals(b);
+        public static bool operator !=(Money a, Money b) => a.Equals(b);
         public static Money operator -(Money a, Money b)
         {

[Killed] Bitwise mutation
MutationTestSample/src/Payment/Money.cs:56:24
         {
             unchecked
             {
-                return Value.GetHashCode() * 397 ^ (int)Currency;
+                return ~(Value.GetHashCode() * 397 ^ (int)Currency);
             }
         }

[Killed] Arithmetic mutation
MutationTestSample/src/Payment/Money.cs:56:24
         {
             unchecked
             {
-                return Value.GetHashCode() * 397 ^ (int)Currency;
+                return Value.GetHashCode() / 397 ^ (int)Currency;
             }
         }
