[Killed] Collection initializer mutation
src/Payment/Users/UserService.cs:45:40
             if (user1 == null) throw new ArgumentException("Both users must be valid.");
             if (user2 == null) throw new ArgumentException("Both users must be valid.");
             
-            if (user1 == user2) return new List<IUser> { user1 };
+            if (user1 == user2) return new List<IUser> {};
 
             Dictionary<IUser, int> distances = new();
