[Killed] Negate expression
src/Payment/Wallets/WalletService.cs:25:17
         {
             if (wallet.Currency != amount.Currency) throw new ArgumentException("User should not be able to contribute in a different currency than the wallet one");
 
-            if (amount.Value <= 0) throw new ArgumentException("User should not be able to contribute with a negative value");
+            if (!(amount.Value <= 0)) throw new ArgumentException("User should not be able to contribute with a negative value");
 
             wallet.AddAmount(amount);
